<center><u><H2>OPERATIONS WITH PANDAS</H2><u/></center>

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'col1':[1,2,3,14,25],'col2':[44,44,66,54,52],'col3':['ab','de','gc','xc','we']})
df.head(3)

   col1  col2 col3
0     1    44   ab
1     2    44   de
2     3    66   gc

In [3]:
df['col2'].sum()

260

In [4]:
(df['col2']==44).sum()

2

In [5]:
df['col2'].count()

5

In [6]:
df['col2'].value_counts()

44    2
54    1
52    1
66    1
Name: col2, dtype: int64

In [7]:
df['col2'].values

array([44, 44, 66, 54, 52], dtype=int64)

In [8]:
a = df.columns.values
b = sorted(a)
b

['col1', 'col2', 'col3']

In [9]:
# sorting by column
df.sort_values(by='col2')

   col1  col2 col3
0     1    44   ab
1     2    44   de
4    25    52   we
3    14    54   xc
2     3    66   gc

In [10]:
df1 = pd.DataFrame([[np.nan, 10, np.nan, 5], [13, 44, np.nan, 11],
                    [np.nan, np.nan, np.nan, 15]],
                   columns=list('ABCD'))
df1

      A     B   C   D
0   NaN  10.0 NaN   5
1  13.0  44.0 NaN  11
2   NaN   NaN NaN  15

In [11]:
#boolean
df1.isnull()

       A      B     C      D
0   True  False  True  False
1  False  False  True  False
2   True   True  True  False

In [12]:
#dropping non values
df1.dropna(inplace=True)
df1

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [13]:
#filling non values
df.loc[6]=[np.nan,2,np.nan]
df.fillna('value',inplace=True)
df

    col1  col2   col3
0      1  44.0     ab
1      2  44.0     de
2      3  66.0     gc
3     14  54.0     xc
4     25  52.0     we
6  value   2.0  value

In [14]:
#Sort by index
df.sort_index(ascending=False,inplace=True)
df

    col1  col2   col3
6  value   2.0  value
4     25  52.0     we
3     14  54.0     xc
2      3  66.0     gc
1      2  44.0     de
0      1  44.0     ab

### STRING OPERATIONS:

In [15]:
#extracting strings:
df['col1'].str.extract('(\w+)', expand=False)

6    value
4      NaN
3      NaN
2      NaN
1      NaN
0      NaN
Name: col1, dtype: object

### Filtering:

In [16]:
df[df['col3']=='ab']

  col1  col2 col3
0    1  44.0   ab

### Uppercase/Lowercase:

In [17]:
df['col3'].str.upper()#lower()

6    VALUE
4       WE
3       XC
2       GC
1       DE
0       AB
Name: col3, dtype: object

In [18]:
df['col3'].str[0]

6    v
4    w
3    x
2    g
1    d
0    a
Name: col3, dtype: object

### Lenght of the string:

In [19]:
df['col3'].str.len()

6    5
4    2
3    2
2    2
1    2
0    2
Name: col3, dtype: int64

### Split:

In [20]:
df['col3'].str.split('c')

6    [value]
4       [we]
3      [x, ]
2      [g, ]
1       [de]
0       [ab]
Name: col3, dtype: object

### Replace:

In [21]:
df['col3'].str.replace(' ','c')

6    value
4       we
3       xc
2       gc
1       de
0       ab
Name: col3, dtype: object

### Contains:

In [22]:
c=df['col3'].str.contains('c')
c

6    False
4    False
3     True
2     True
1    False
0    False
Name: col3, dtype: bool

### ONE HOT ENCODING:

In [23]:
#The output will be a sparse matrix where each column corresponds to one possible value of one feature
dfhot = pd.DataFrame({'gender':['male','female','male','female','male'],'age_range':['young','adult','senior','young','adult']})
dfhot

   gender age_range
0    male     young
1  female     adult
2    male    senior
3  female     young
4    male     adult

In [24]:
data_dummies = pd.get_dummies(dfhot)
data_dummies

,gender_female,gender_male,age_range_adult,age_range_senior,age_range_young
0,0,1,0,0,1
1,1,0,1,0,0
2,0,1,0,1,0
3,1,0,0,0,1
4,0,1,1,0,0

## References:

https://pandas.pydata.org/pandas-docs/stable/generated/pandas.get_dummies.html

https://pandas.pydata.org/pandas-docs/stable/text.html